app/Controllers/Admin.php

SELECT *
FROM `pendaftaran`
---
    public function dashboard()
    {
        // proteksi halaman
        if (! session()->get('logged_in')) {
            session()->setFlashdata('error', 'Anda Belum Login !');
            return redirect()->to('/login');
        }

        $pendaftaran = new DataPendaftaran();
        $_pendaftar = new Pendaftaran();
        $tahap = new DataTahap();
        $stateModel = new Periode();
        $tahap = new DataTahap();
        $pendaftar = new DataPendaftar();
        $periodeModel = new Periode();
        $countryModel = new Provinces();
        $this->data['state'] = $pendaftaran->join('tahap', 'tahap.id = pendaftaran.tahap')->where('pendaftaran.periode',2)->findAll();
        $this->data['query'] = $pendaftaran->select('pendaftaran.id_pendaftar, tahap.nama_tahap, id, COUNT( * ) as total')->join('tahap', 'tahap.id = pendaftaran.tahap')->where('pendaftaran.periode', 2)->groupBy('id')->findAll();
        $this->data['query_l'] = $pendaftaran->select('pendaftaran.id_pendaftar, tahap.nama_tahap, tahap.id, COUNT( * ) as total')->join('tahap', 'tahap.id = pendaftaran.tahap')->join('data_pendaftar', 'data_pendaftar.id = pendaftaran.id_pendaftar')->where('pendaftaran.periode', 2)->where('data_pendaftar.jenis_kelamin','l')->groupBy('tahap.id')->findAll();
        //test
        $this->data['cek'] = $pendaftar->select('sum(jenis_kelamin = "p") P, sum(jenis_kelamin = "l") L, tahap.nama_tahap')->join('pendaftaran', 'pendaftaran.id_pendaftar = data_pendaftar.id')->join('tahap', 'tahap.id = pendaftaran.tahap')->where('pendaftaran.periode', 2)->groupBy('tahap.nama_tahap')->findAll();

        $this->data['state2'] = $tahap->where('id_periode', 2)->orderBy('id', 'ASC')->findAll();
        $state1 = $pendaftaran->findAll();

SELECT *
FROM `tahap`
WHERE `id_periode` = 2
ORDER BY `id` ASC
---
        $this->data['pendaftar_p'] = $pendaftar->join('pendaftaran', 'pendaftaran.id_pendaftar = data_pendaftar.id')->join('tahap', 'tahap.id = pendaftaran.tahap')->where('data_pendaftar.jenis_kelamin','p')->findAll();

        $this->data['tahap'] = $tahap->findall();
        $this->data['tahapan'] =$tahap->where('id_periode',session()->periode)->findAll();

SELECT *
FROM `jalur`
JOIN `pendaftaran` ON `pendaftaran`.`jalur` = `jalur`.`id`
WHERE `pendaftaran`.`id_pendaftar` = '19'
 LIMIT 1
SELECT *
FROM `agenda`
 LIMIT 1
---
    public function dashboard_siswa()
    {
        $pendaftar = new DataPendaftar();
        $jalur = new DataJalur();
        $tahap = new DataTahap();
        $periode = new DataPeriode();
        $agenda = new DataAgenda();
        $getid = session()->get('id_ref');
        $pendaftaran = new DataPendaftaran();

        // proteksi halaman
        if (! session()->get('logged_in')) {
            session()->setFlashdata('error', 'Anda Belum Login !');
            return redirect()->to('/login');
        }

        //data object
        $this->data['page'] = 'Selamat Datang '.session()->get('nama_user').'!';
        $this->data['ket'] = 'Di Aplikasi Penerimaan Peserta Didik Baru SMK WIDYA MANDALA TAMBAK';
        $this->data['title'] = 'Dashboard Siswa';
        $this->data['data_pendaftar'] = $pendaftar->join('user', 'user.id_ref = data_pendaftar.id')->where('data_pendaftar.id', $getid)->first();
        $this->data['data_pendaftaran'] = $pendaftaran->join('data_pendaftar', 'data_pendaftar.id = pendaftaran.id_pendaftar')->where('data_pendaftar.id', $getid)->first();
        $this->data['data_periode'] = $periode->join('pendaftaran', 'pendaftaran.periode = periode.id')->where('pendaftaran.id_pendaftar', $getid)->first();
        $this->data['data_tahap'] = $tahap->join('pendaftaran', 'pendaftaran.tahap = tahap.id')->where('pendaftaran.id_pendaftar', $getid)->first();

        $this->data['data_jalur'] = $jalur->join('pendaftaran', 'pendaftaran.jalur = jalur.id')->where('pendaftaran.id_pendaftar', $getid)->first();
        $this->data['data_agenda'] = $agenda->first();

SELECT *
FROM `tahap`
WHERE `id` = '9'
 LIMIT 1
SELECT *
FROM `tahap`
WHERE `id_periode` = '2'
SELECT *
FROM `jalur`
WHERE `id_tahap` = '9'
 LIMIT 1
SELECT *
FROM `periode`
WHERE `id` = '2'
 LIMIT 1
SELECT *
FROM `data_pendaftar`
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `data_pendaftar`
JOIN `user` ON `user`.`id_ref` = `data_pendaftar`.`id`
SELECT *
FROM `pembayaran`
JOIN `data_pendaftar` ON `data_pendaftar`.`id` = `pembayaran`.`id_pendaftar`
WHERE `pembayaran`.`id_pendaftar` = '9'
 LIMIT 1
---
    public function data_pendaftar($id)
    {
        // proteksi halaman
        if (! session()->get('logged_in')) {
            session()->setFlashdata('error', 'Anda Belum Login !');
            return redirect()->to('/login');
        }
        $jalur = new DataJalur();

        $tahap = new DataTahap();

        $pendaftaran = new DataPendaftaran();

        $pendaftar = new DataPendaftar();
        $pembayaran = new DataPembayaran();

        // get input nomor pendaftar
        $this->data['tahap'] = $tahap->where('id',$id)->first();
        $this->data['tahapan'] =$tahap->where('id_periode',session()->periode)->findAll();
        $this->data['jalur1'] = $jalur->where('id_tahap', $this->data['tahap']->id)->first();
        $periode = new DataPeriode();
        $this->data['periode'] = $periode->where('id', $this->data['tahap']->id_periode)->first();
        $pendaftar = new DataPendaftar();
        $data_pendaftar = $pendaftar->orderBy('id', 'DESC')->first();
        if ($data_pendaftar != null) {
            $id_pendaftar = $data_pendaftar->id;
        } else $id_pendaftar = '0';

        if ($this->data['jalur1']) {
            $this->data['nomor_pendaftar'] = $this->data['periode']->id . $this->data['tahap']->id . $this->data['jalur1']->id . '000' . $id_pendaftar;
            $this->data['pendaftar'] = $pendaftar->join('user', 'user.id_ref = data_pendaftar.id')->findAll();
            $id_pendaftar = $pembayaran->join('data_pendaftar', 'data_pendaftar.id = pembayaran.id_pendaftar')->where('pembayaran.id_pendaftar',$id)->first();

SELECT *
FROM `pendaftaran`
---

        $this->data['stat']=$this->codeAll('STATUS PENERIMAAN');

        $this->data['pendaftaran'] = $pendaftaran->findAll();

SELECT *
FROM `tahap`
WHERE `id_periode` = '2'
SELECT *
FROM `user`
SELECT *
FROM `pembayaran`
SELECT *
FROM `user`
JOIN `data_pendaftar` ON `data_pendaftar`.`id` = `user`.`id_ref`
WHERE `data_pendaftar`.`status_penerimaan` = '106'
---
    public function data_pembayaran()
    {
        // proteksi halaman
        if (! session()->get('logged_in')) {
            session()->setFlashdata('error', 'Anda Belum Login !');
            return redirect()->to('/login');
        }

        // Set your Merchant Server Key
        \Midtrans\Config::$serverKey = 'SB-Mid-server-vMrJTbzKEfdvuviQdOvnvuC5';
        // Set to Development/Sandbox Environment (default). Set to true for Production Environment (accept real transaction).
        \Midtrans\Config::$isProduction = false;
        // Set sanitization on (default)
        \Midtrans\Config::$isSanitized = true;
        // Set 3DS transaction for credit card to true
        \Midtrans\Config::$is3ds = true;

        $pembayaran = new DataPembayaran();
        $user = new Users();
        $tahap = new DataTahap();
        $this->data['tahapan'] =$tahap->where('id_periode',session()->periode)->findAll();
        $this->data['user'] = $user->findAll();
        $this->data['pembayaran'] = $pembayaran->findAll();
        $stat = $this->codeWithName('Daftar Ulang Berhasil');
        // $this->data['data_pendaftar'] = $pendaftar->where('status_penerimaan', $stat->id)->findAll();
        $this->data['data_pendaftar'] = $user->join('data_pendaftar', 'data_pendaftar.id = user.id_ref')->where('data_pendaftar.status_penerimaan',$stat->id)->findAll();

SELECT *
FROM `periode`
SELECT *
FROM `tahap`
---
    public function tahap()
    {
        // proteksi halaman
        if (! session()->get('logged_in')) {
            session()->setFlashdata('error', 'Anda Belum Login !');
            return redirect()->to('/login');
        }
        $periode = new DataPeriode();

        $tahap = new DataTahap();
        $this->data['tahapan'] =$tahap->where('id_periode',session()->periode)->findAll();

        $this->data['page'] = 'Data Tahap';
        $this->data['ket'] = 'Tahap PPDB SMK WIDYA MANDALA TAMBAK';
        $this->data['title'] = 'Data Tahap';
        $this->data['isFullCalendar'] = true;
        $this->data['activePage'] = 'tahap';

        $this->data['periode'] = $periode->findall();

        $this->data['tahap'] = $tahap->findall();