app/Controllers/Admin.php

    public function dashboard()
    {
        // proteksi halaman
        if (! session()->get('logged_in')) {
            session()->setFlashdata('error', 'Anda Belum Login !');
            return redirect()->to('/login');
        }
        // <pre>
        //     function tampil_kota(){
        //         $this->db->select('id, kota, provinsi, COUNT(provinsi) as total');
        //         $this->db->group_by('provinsi');
        //         $this->db->order_by('total', 'desc');
        //         $hasil = $this->db->get('tablename');
        //         return $hasil;
        //     }
        // </pre>

        // <pre> function index(){
        //     $b['data'] = $this->m_model->tampil_kota();
        //     $this-->load->view('view_tampil',$b);
        // }
        // </pre>
        $pendaftaran = new DataPendaftaran();
        $_pendaftar = new Pendaftaran();
        $tahap = new DataTahap();
        $data['state'] = $pendaftaran->join('tahap', 'tahap.id = pendaftaran.tahap')->where('pendaftaran.periode',2)->findAll();
        $data['query'] = $pendaftaran->select('pendaftaran.id_pendaftar, tahap.nama_tahap, id, COUNT( * ) as total')->join('tahap', 'tahap.id = pendaftaran.tahap')->where('pendaftaran.periode', 2)->groupBy('id')->findAll();

        $data['query_l'] = $pendaftaran->select('pendaftaran.id_pendaftar, tahap.nama_tahap, tahap.id, COUNT( * ) as total')->join('tahap', 'tahap.id = pendaftaran.tahap')->join('data_pendaftar', 'data_pendaftar.id = pendaftaran.id_pendaftar')->where('pendaftaran.periode', 2)->where('data_pendaftar.jenis_kelamin','l')->groupBy('tahap.id')->findAll();
        $data['query_p'] = $pendaftaran->select('pendaftaran.id_pendaftar, tahap.nama_tahap, tahap.id, COUNT( * ) as total')->join('tahap', 'tahap.id = pendaftaran.tahap')->join('data_pendaftar', 'data_pendaftar.id = pendaftaran.id_pendaftar')->where('pendaftaran.periode', 2)->where('data_pendaftar.jenis_kelamin','p')->groupBy('tahap.id')->findAll();
---
SELECT *
FROM `pendaftaran`
JOIN `tahap` ON `tahap`.`id` = `pendaftaran`.`tahap`
WHERE `pendaftaran`.`periode` = 2
SELECT `pendaftaran`.`id_pendaftar`, `tahap`.`nama_tahap`, `id`, COUNT( * ) as total
FROM `pendaftaran`
JOIN `tahap` ON `tahap`.`id` = `pendaftaran`.`tahap`
WHERE `pendaftaran`.`periode` = 2
GROUP BY `id`
SELECT `pendaftaran`.`id_pendaftar`, `tahap`.`nama_tahap`, `tahap`.`id`, COUNT( * ) as total
FROM `pendaftaran`
JOIN `tahap` ON `tahap`.`id` = `pendaftaran`.`tahap`
JOIN `data_pendaftar` ON `data_pendaftar`.`id` = `pendaftaran`.`id_pendaftar`
WHERE `pendaftaran`.`periode` = 2
AND `data_pendaftar`.`jenis_kelamin` = 'l'
GROUP BY `tahap`.`id`
SELECT `pendaftaran`.`id_pendaftar`, `tahap`.`nama_tahap`, `tahap`.`id`, COUNT( * ) as total
FROM `pendaftaran`
JOIN `tahap` ON `tahap`.`id` = `pendaftaran`.`tahap`
JOIN `data_pendaftar` ON `data_pendaftar`.`id` = `pendaftaran`.`id_pendaftar`
WHERE `pendaftaran`.`periode` = 2
AND `data_pendaftar`.`jenis_kelamin` = 'p'
GROUP BY `tahap`.`id`

        $state1 = $pendaftaran->findAll();

        $stateModel = new Periode();
        $data['statedata'] = $stateModel->join('tahap', 'tahap.id_periode = periode.id')->join('pendaftaran', 'pendaftaran.periode = periode.id')->where('periode.id', 2)->findAll();
        $data['jml_'] = $stateModel->join('tahap', 'tahap.id_periode = periode.id')->join('pendaftaran', 'pendaftaran.periode = periode.id')->where('periode.id', 2)->findAll();
---
SELECT *
FROM `periode`
JOIN `tahap` ON `tahap`.`id_periode` = `periode`.`id`
JOIN `pendaftaran` ON `pendaftaran`.`periode` = `periode`.`id`
WHERE `periode`.`id` = 2


        $tahap = new DataTahap();
        $pendaftar = new DataPendaftar();
        $data['pendaftar_zonasi'] = $pendaftar->join('pendaftaran', 'pendaftaran.id_pendaftar = data_pendaftar.id')->where('pendaftaran.jalur', '15')->findAll();
        $data['pendaftar_laki_zonasi'] = $pendaftar->join('pendaftaran', 'pendaftaran.id_pendaftar = data_pendaftar.id')->where('pendaftaran.jalur', '15')->where('data_pendaftar.jenis_kelamin','l')->findAll();
        $data['pendaftar_p_zonasi'] = $pendaftar->join('pendaftaran', 'pendaftaran.id_pendaftar = data_pendaftar.id')->where('pendaftaran.jalur', '15')->where('data_pendaftar.jenis_kelamin','p')->findAll();


        $data['pendaftar'] = $pendaftar->join('pendaftaran', 'pendaftaran.id_pendaftar = data_pendaftar.id')->join('tahap', 'tahap.id = pendaftaran.tahap')->findAll();
        $data['pendaftar_laki'] = $pendaftar->join('pendaftaran', 'pendaftaran.id_pendaftar = data_pendaftar.id')->join('tahap', 'tahap.id = pendaftaran.tahap')->where('data_pendaftar.jenis_kelamin','l')->findAll();
        $data['pendaftar_p'] = $pendaftar->join('pendaftaran', 'pendaftaran.id_pendaftar = data_pendaftar.id')->join('tahap', 'tahap.id = pendaftaran.tahap')->where('data_pendaftar.jenis_kelamin','p')->findAll();

        $data['tahapan'] = $tahap->join('pendaftaran', 'pendaftaran.tahap = tahap.id')->where('pendaftaran.periode', '2')->findAll();

        $data['tahap'] = $tahap->findall();
---
SELECT *
FROM `data_pendaftar`
JOIN `pendaftaran` ON `pendaftaran`.`id_pendaftar` = `data_pendaftar`.`id`
WHERE `pendaftaran`.`jalur` = '15'
SELECT *
FROM `data_pendaftar`
JOIN `pendaftaran` ON `pendaftaran`.`id_pendaftar` = `data_pendaftar`.`id`
WHERE `pendaftaran`.`jalur` = '15'
AND `data_pendaftar`.`jenis_kelamin` = 'l'
SELECT *
FROM `data_pendaftar`
JOIN `pendaftaran` ON `pendaftaran`.`id_pendaftar` = `data_pendaftar`.`id`
WHERE `pendaftaran`.`jalur` = '15'
AND `data_pendaftar`.`jenis_kelamin` = 'p'
SELECT *
FROM `tahap`
JOIN `pendaftaran` ON `pendaftaran`.`tahap` = `tahap`.`id`
WHERE `pendaftaran`.`id_pendaftar` = '19'
 LIMIT 1
SELECT *
FROM `data_pendaftar`
JOIN `pendaftaran` ON `pendaftaran`.`id_pendaftar` = `data_pendaftar`.`id`
JOIN `tahap` ON `tahap`.`id` = `pendaftaran`.`tahap`
SELECT *
FROM `data_pendaftar`
JOIN `pendaftaran` ON `pendaftaran`.`id_pendaftar` = `data_pendaftar`.`id`
JOIN `tahap` ON `tahap`.`id` = `pendaftaran`.`tahap`
WHERE `data_pendaftar`.`jenis_kelamin` = 'l'
SELECT *
FROM `data_pendaftar`
JOIN `pendaftaran` ON `pendaftaran`.`id_pendaftar` = `data_pendaftar`.`id`
JOIN `tahap` ON `tahap`.`id` = `pendaftaran`.`tahap`
WHERE `data_pendaftar`.`jenis_kelamin` = 'p'
SELECT *
FROM `periode`
JOIN `pendaftaran` ON `pendaftaran`.`periode` = `periode`.`id`
WHERE `pendaftaran`.`id_pendaftar` = '19'
 LIMIT 1
SELECT *
FROM `tahap`
JOIN `pendaftaran` ON `pendaftaran`.`tahap` = `tahap`.`id`
WHERE `pendaftaran`.`periode` = '2'
SELECT *
FROM `tahap`

        $data['title'] = 'Dashboard';

        $periodeModel = new Periode();
        $data['periode'] = $periodeModel->orderBy('id', 'ASC')->findAll();
        $data['periode_get'] = $periodeModel->orderBy('id', 'ASC')->where('status','tidak_aktif')->findAll();
        $data['get_periode'] = $periodeModel->where('status','aktif')->first();
        $countryModel = new Provinces();
        $data['country'] = $countryModel->orderBy('prov_name', 'ASC')->findAll();
---
SELECT *
FROM `periode`
ORDER BY `id` ASC
SELECT *
FROM `periode`
WHERE `status` = 'tidak_aktif'
ORDER BY `id` ASC
SELECT *
FROM `periode`
WHERE `status` = 'aktif'
 LIMIT 1
SELECT *
FROM `provinces`
ORDER BY `prov_name` ASC

    public function dashboard_siswa()
    {
        $pendaftar = new DataPendaftar();
        $jalur = new DataJalur();
        $tahap = new DataTahap();
        $periode = new DataPeriode();
        $agenda = new DataAgenda();
        $getid = session()->get('id_ref');
        $pendaftaran = new DataPendaftaran();

        // proteksi halaman
        if (! session()->get('logged_in')) {
            session()->setFlashdata('error', 'Anda Belum Login !');
            return redirect()->to('/login');
        }

        //data object
        $data['page'] = 'dashboard-siswa';
        $data['data_pendaftar'] = $pendaftar->join('user', 'user.id_ref = data_pendaftar.id')->where('data_pendaftar.id', $getid)->first();
        $data['data_pendaftaran'] = $pendaftaran->join('data_pendaftar', 'data_pendaftar.id = pendaftaran.id_pendaftar')->where('data_pendaftar.id', $getid)->first();
        $data['data_periode'] = $periode->join('pendaftaran', 'pendaftaran.periode = periode.id')->where('pendaftaran.id_pendaftar', $getid)->first();
        $data['data_tahap'] = $tahap->join('pendaftaran', 'pendaftaran.tahap = tahap.id')->where('pendaftaran.id_pendaftar', $getid)->first();

        $data['data_jalur'] = $jalur->join('pendaftaran', 'pendaftaran.jalur = jalur.id')->where('pendaftaran.id_pendaftar', $getid)->first();
        $data['data_agenda'] = $agenda->first();
---
SELECT *
FROM `periode`
JOIN `pendaftaran` ON `pendaftaran`.`periode` = `periode`.`id`
WHERE `pendaftaran`.`id_pendaftar` = '18'
 LIMIT 1
SELECT *
FROM `tahap`
JOIN `pendaftaran` ON `pendaftaran`.`tahap` = `tahap`.`id`
WHERE `pendaftaran`.`id_pendaftar` = '18'
 LIMIT 1
SELECT *
FROM `jalur`
JOIN `pendaftaran` ON `pendaftaran`.`jalur` = `jalur`.`id`
WHERE `pendaftaran`.`id_pendaftar` = '18'
 LIMIT 1
SELECT *
FROM `agenda`
 LIMIT 1

    public function data_pendaftar($id)
    {
        // proteksi halaman
        if (! session()->get('logged_in')) {
            session()->setFlashdata('error', 'Anda Belum Login !');
            return redirect()->to('/login');
        }
        $jalur = new DataJalur();

        $tahap = new DataTahap();

        $pendaftaran = new DataPendaftaran();

        $pendaftar = new DataPendaftar();
        $pembayaran = new DataPembayaran();

        // get input nomor pendaftar
        $data['tahap'] = $tahap->where('id',$id)->first();
        $data['jalur1'] = $jalur->where('id_tahap', $data['tahap']->id)->first();
        $periode = new DataPeriode();
        $data['periode'] = $periode->where('id', $data['tahap']->id_periode)->first();
        $pendaftar = new DataPendaftar();
        $data_pendaftar = $pendaftar->orderBy('id', 'DESC')->first();
        if ($data_pendaftar != null) {
            $id_pendaftar = $data_pendaftar->id;
        } else $id_pendaftar = '0';

        if ($data['jalur1']) {
            $data['nomor_pendaftar'] = $data['periode']->id . $data['tahap']->id . $data['jalur1']->id . '000' . $id_pendaftar;
            $data['pendaftar'] = $pendaftar->join('user', 'user.id_ref = data_pendaftar.id')->findAll();
            $id_pendaftar = $pembayaran->join('data_pendaftar', 'data_pendaftar.id = pembayaran.id_pendaftar')->where('pembayaran.id_pendaftar',$id)->first();
            $data['id'] = $id_pendaftar;

            $data['jalur'] = $jalur->where('id_tahap',$id)->findAll();
---
SELECT *
FROM `tahap`
WHERE `id` = '9'
 LIMIT 1
SELECT *
FROM `jalur`
WHERE `id_tahap` = '9'
 LIMIT 1
SELECT *
FROM `periode`
WHERE `id` = '2'
 LIMIT 1
SELECT *
FROM `data_pendaftar`
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `data_pendaftar`
JOIN `user` ON `user`.`id_ref` = `data_pendaftar`.`id`
SELECT *
FROM `pembayaran`
JOIN `data_pendaftar` ON `data_pendaftar`.`id` = `pembayaran`.`id_pendaftar`
WHERE `pembayaran`.`id_pendaftar` = '9'
 LIMIT 1
SELECT *
FROM `jalur`
WHERE `id_tahap` = '9'


        $data['stat']=$this->codeAll('STATUS PENERIMAAN');

        $data['pendaftaran'] = $pendaftaran->findAll();
---
SELECT *
FROM `pendaftaran`

    public function pilih_tahap($id)
    {

        // proteksi halaman
        if (! session()->get('logged_in')) {
            session()->setFlashdata('error', 'Anda Belum Login !');
            return redirect()->to('/login');
        }
        $tahap = new DataTahap();
        $data['tahap'] = $tahap->where('id_periode',$id)->findAll();
---
SELECT *
FROM `tahap`
WHERE `id_periode` = '2'