app/Controllers/Base.php

    public function codeAll($nama_kategori){
        $kode = new KodeAplikasi();
        $kategori = new KategoriKode();
        $datakategori = $kategori->where('nama_kategori',$nama_kategori)->first();
        $dataKode = $kode->where('id_kategori',$datakategori->id)->findall();
---
SELECT *
FROM `kategori_kode`
WHERE `nama_kategori` = 'JENIS PRESTASI'
 LIMIT 1
SELECT *
FROM `kode_aplikasi`
WHERE `id_kategori` = '9'

    public function code($id){
        $kode = new KodeAplikasi();
        $dataKode = $kode->where('id', $id)->first();
---
SELECT *
FROM `kode_aplikasi`
WHERE `id` = '101'
 LIMIT 1

    public function codeWithName($nama_opsi){
        $kode = new KodeAplikasi();
        $dataKode = $kode->where('nama_opsi', $nama_opsi)->first();
---
SELECT *
FROM `kode_aplikasi`
WHERE `nama_opsi` = 'Reguler'
 LIMIT 1