app/Controllers/BaseController.php

    public function codeAll($nama_kategori){
        $kode = new KodeAplikasi();
        $kategori = new KategoriKode();
        $datakategori = $kategori->where('nama_kategori',$nama_kategori)->first();
        $dataKode = $kode->where('id_kategori',$datakategori->id)->findall();
---
SELECT *
FROM `kategori_kode`
WHERE `nama_kategori` = 'STATUS PENERIMAAN'
 LIMIT 1
SELECT *
FROM `kode_aplikasi`
WHERE `id_kategori` = '15'

    public function codeWithName($nama_opsi){
        $kode = new KodeAplikasi();
        $dataKode = $kode->where('nama_opsi', $nama_opsi)->first();
---
SELECT *
FROM `kode_aplikasi`
WHERE `nama_opsi` = 'Daftar Ulang Berhasil'
 LIMIT 1