app/Controllers/Dynamic_dependent.php

SELECT *
FROM `periode`
WHERE `status` = 'aktif'
 LIMIT 1
---
			if ($action == 'get_pendaftar') {
				$pendaftar = new DataPendaftar();
				$periodeModel = new Periode();
				$getPeriode = $periodeModel->where('status', 'aktif')->first();