app/Controllers/Dynamic_dependent.php


				$user = new Users();

				$data_user = $user->where('nomor_pendaftaran', $this->request->getVar('nomor'))->first();
---
SELECT *
FROM `user`
WHERE `nomor_pendaftaran` = '291500028'
 LIMIT 1

				$pendaftaran = new DataPendaftaran();
				$tahap = new DataTahap();
				$stateModel = new Periode();
				$statedata = $tahap->where('id_periode', $this->request->getVar('periode'))->findAll();
				$query = $pendaftaran->select('pendaftaran.id_pendaftar, tahap.nama_tahap, id, COUNT( * ) as total')->join('tahap', 'tahap.id = pendaftaran.tahap')->where('pendaftaran.periode', $this->request->getVar('periode'))->groupBy('id')->findAll();
				$data['statedata'] = $stateModel->join('tahap', 'tahap.id_periode = periode.id')->join('pendaftaran', 'pendaftaran.periode = periode.id')->where('periode.id', 2)->findAll();
---
SELECT *
FROM `tahap`
WHERE `id_periode` IS NULL
SELECT sum(jenis_kelamin = "p") total_p, sum(jenis_kelamin = "l") total_l, `tahap`.`nama_tahap`
FROM `data_pendaftar`
JOIN `pendaftaran` ON `pendaftaran`.`id_pendaftar` = `data_pendaftar`.`id`
JOIN `tahap` ON `tahap`.`id` = `pendaftaran`.`tahap`
WHERE `pendaftaran`.`periode` = '2'
GROUP BY `tahap`.`nama_tahap`
SELECT `pendaftaran`.`id_pendaftar`, `tahap`.`nama_tahap`, `id`, COUNT( * ) as total
FROM `pendaftaran`
JOIN `tahap` ON `tahap`.`id` = `pendaftaran`.`tahap`
WHERE `pendaftaran`.`periode` IS NULL
GROUP BY `id`
SELECT *
FROM `periode`
JOIN `tahap` ON `tahap`.`id_periode` = `periode`.`id`
JOIN `pendaftaran` ON `pendaftaran`.`periode` = `periode`.`id`
WHERE `periode`.`id` = 2