app/Controllers/Home.php

    public function index()
    {
        $periode = new DataPeriode();
        $tahap = new DataTahap();
        $jurusan = new DataJurusan();
        $jalur = new DataJalur();
        $agenda = new DataAgenda();
        $data['page'] = 'Beranda';
        $data['periode'] = $periode->where('status', 'aktif')->first();
        $data['jurusan'] = $jurusan->where('status', 'aktif')->findAll();
        $data['agenda'] = $agenda->findAll();
        $date = date('Y-m-d');

        $data_tahap = $tahap->where(['id_periode' => $data['periode']->id, 'tanggal_mulai <=' => $date, 'tanggal_selesai >=' => $date, 'status' => 'aktif'])->first();

        if (!$data_tahap) {
            $data['tahap'] = $tahap->where('id_periode', $data['periode']->id)->orderBy('id', 'DESC')->first();
            $html1 = '<a class="ms-3 mt-3 btn btn-lg btn-warning btn-daftar" href="#">Belum ada pendaftaran pada saat ini</a>';
            $html2 = '<a class="btn btn-warning" href="#">Belum ada pendaftaran pada saat ini</a>';
            $html3 = '<a class="btn btn-primary disabled" style="background-color: #4D7C0F;" href="#">Daftar</a>';
            $data['isi_jalur'] = $html1;
            $data['isi_jalurbtn'] = $html2;
            $data['daftar_nav'] = $html3;
            $data['jalur'] = $jalur->findAll();
---
SELECT *
FROM `periode`
WHERE `status` = 'aktif'
 LIMIT 1
SELECT *
FROM `jurusan`
WHERE `status` = 'aktif'
SELECT *
FROM `agenda`
SELECT *
FROM `tahap`
WHERE `id_periode` = '2'
AND `tanggal_mulai` <= '2024-02-05'
AND `tanggal_selesai` >= '2024-02-05'
AND `status` = 'aktif'
 LIMIT 1
SELECT *
FROM `tahap`
WHERE `id_periode` = '2'
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `jalur`

            $data['isi_jalur'] = $html2;
            $data['isi_jalurbtn'] = $html1;
            $data['daftar_nav'] = $html3;
            $data['tahap'] = $tahap->where(['id_periode' => $data['periode']->id, 'tanggal_mulai <=' => $date, 'tanggal_selesai >=' => $date])->first();
            $data['jalur'] = $jalur->where('id_tahap', $data_tahap->id)->findAll();
---
SELECT *
FROM `tahap`
WHERE `id_periode` = '2'
AND `tanggal_mulai` <= '2024-02-05'
AND `tanggal_selesai` >= '2024-02-05'
 LIMIT 1
SELECT *
FROM `jalur`
WHERE `id_tahap` = '12'