app/Controllers/Login.php

    public function process()
    {
        $users = new Users();
        $pendaftar = new DataPendaftar();
        $periode = new DataPeriode();
        $stat1 = $this->codeWithName('Lulus Seleksi');
        $stat2 = $this->codeWithName('Menunggu Konfirmasi Pembayaran');
        $stat3 = $this->codeWithName('Pembayaran Berhasil');
        $stat4 = $this->codeWithName('Daftar Ulang Berhasil');
        $akun = $this->request->getVar('akun');
        $password = $this->request->getVar('password');
        $data_user = $users->where([
            'email' => $akun,
            'status' => 'aktif',
        ])->first();
        if ($data_user == null || $data_user == '') {
            $data_user = $users->where([
                'nomor_pendaftaran' => $akun,
                'status' => 'aktif',
            ])->first();
        }
        if ($data_user) {
            if (password_verify($password, $data_user->password)) {
                $data_pendaftar = $pendaftar->where('id', $data_user->id_ref)->first();
                $data_periode = $periode->where('status', 'aktif')->first();
---
SELECT *
FROM `user`
WHERE `email` = '0'
AND `status` = 'aktif'
 LIMIT 1
SELECT *
FROM `user`
WHERE `nomor_pendaftaran` = '0'
AND `status` = 'aktif'
 LIMIT 1
SELECT *
FROM `data_pendaftar`
WHERE `id` = '0'
 LIMIT 1
SELECT *
FROM `periode`
WHERE `status` = 'aktif'
 LIMIT 1