app/Controllers/Pembayaran.php

    public function konfirmasi_pembayaran($id)
    {
        $user = new Users();
        // proteksi halaman
        if (! session()->get('logged_in')) {
            session()->setFlashdata('error', 'Anda Belum Login !');
            return redirect()->to('/login');
        }

        //view
        $pendaftar = new DataPendaftar();
        $pembayaran = new DataPembayaran();
        $city = new Cities();
        $postalcode = new Postalcode();
        $this->data['pembayaran'] = $pembayaran->where('id_pendaftar',$id)->first();

        $this->data['stat'] = $this->codeWithName('Daftar Ulang Berhasil');

        $this->data['user'] = $user->where('id_ref',$id)->first();

        $this->data['pendaftar'] = $pendaftar->where('id',$id)->first();

        $this->data['city'] = $city->where('city_id', $this->data['pendaftar']->kabupaten)->first();

        $this->data['postalcode'] = $postalcode->where('postal_id', $this->data['pendaftar']->kode_pos)->first();
---
SELECT *
FROM `pembayaran`
WHERE `id_pendaftar` = '28'
 LIMIT 1
SELECT *
FROM `user`
WHERE `id_ref` = '28'
 LIMIT 1
SELECT *
FROM `data_pendaftar`
WHERE `id` = '28'
 LIMIT 1
SELECT *
FROM `cities`
WHERE `city_id` = '246'
 LIMIT 1
SELECT *
FROM `ec_postalcode`
WHERE `postal_id` = '15720'
 LIMIT 1