app/Controllers/Pendaftar.php

        $data['pendaftar'] = $pendaftar->join('user', 'user.id_ref = data_pendaftar.id')->join('pendaftaran', 'pendaftaran.id_pendaftar = data_pendaftar.id')->join('jalur', 'jalur.id = pendaftaran.jalur')->where('data_pendaftar.id', $id)->first();

        $orang_tua = new DataOrangTua();
        $data['ibu'] = $orang_tua->where(['id_siswa' => $data['pendaftar']->id_ref, 'jenis_orang_tua' => '2'])->first();
        $data['ayah'] = $orang_tua->where(['id_siswa' => $data['pendaftar']->id_ref, 'jenis_orang_tua' => '1'])->first();
        $data['wali'] = $orang_tua->where(['id_siswa' => $data['pendaftar']->id_ref, 'jenis_orang_tua' => '3'])->first();

        $countryModel = new Provinces();
        $data['country'] = $countryModel->orderBy('prov_name', 'ASC')->findAll();

        $city = new Cities();
        $data['city'] = $city->where('city_id', $data['pendaftar']->kabupaten)->first();

        $district = new Districts();
        $data['district'] = $district->where('dis_id', $data['pendaftar']->kecamatan)->first();

        $subdistrict = new Subdistricts();
        $data['subdistrict'] = $subdistrict->where('subdis_id', $data['pendaftar']->kelurahan)->first();

        $jurusan = new DataJurusan();
        $data['jurusan'] = $jurusan->findAll();

        $sekolah = new DataSekolah();
        $data['sekolah'] = $sekolah->findAll();

        $postalcode = new Postalcode();
        $data['postalcode'] = $postalcode->where('postal_id', $data['pendaftar']->kode_pos)->first();

        $rapot = new Rapot();
        $data['rapot'] = $rapot->findAll();
---
SELECT *
FROM `data_orang_tua`
WHERE `id_siswa` = '21'
AND `jenis_orang_tua` = '2'
 LIMIT 1
SELECT *
FROM `data_orang_tua`
WHERE `id_siswa` = '21'
AND `jenis_orang_tua` = '1'
 LIMIT 1
SELECT *
FROM `data_orang_tua`
WHERE `id_siswa` = '21'
AND `jenis_orang_tua` = '3'
 LIMIT 1
SELECT *
FROM `provinces`
ORDER BY `prov_name` ASC
SELECT *
FROM `cities`
WHERE `city_id` IS NULL
 LIMIT 1
SELECT *
FROM `districts`
WHERE `dis_id` IS NULL
 LIMIT 1
SELECT *
FROM `subdistricts`
WHERE `subdis_id` IS NULL
 LIMIT 1
SELECT *
FROM `jurusan`
SELECT *
FROM `data_sekolah`
SELECT *
FROM `ec_postalcode`
WHERE `postal_id` IS NULL
 LIMIT 1
SELECT *
FROM `rapot`

        $data['prestasi'] = $data_prestasi->where('id_siswa', $id)->findAll();

        $beasiswa = new DataBeasiswa();
        $data['beasiswa'] = $beasiswa->where('id_siswa', $id)->findAll();

        $data_afirmasi = new DataAfirmasi();
        $data['afirmasi'] = $data_afirmasi->where('id_pendaftar', $id)->findAll();

        $jenis_nilai = new JenisNilai();
        $data['jenis_nilai'] = $jenis_nilai->where('id_pendaftar', $id)->findAll();
---
SELECT *
FROM `beasiswa`
WHERE `id_siswa` = '21'
SELECT *
FROM `afirmasi`
WHERE `id_pendaftar` = '21'
SELECT *
FROM `jenis_nilai`
WHERE `id_pendaftar` = '21'