app/Controllers/User.php

    public function formulir_pendaftaran($id)
    {
        $countryModel = new Provinces();
        $data['country'] = $countryModel->orderBy('prov_name', 'ASC')->findAll();

        $jalur = new DataJalur();
        $data['jalur'] = $jalur->where('id', $id)->first();

        $tahap = new DataTahap();
        $data['tahap'] = $tahap->where('id', $data['jalur']->id_tahap)->first();

        $periode = new DataPeriode();
        $data['periode'] = $periode->where('id', $data['tahap']->id_periode)->first();

        $pendaftar = new DataPendaftar();
        $data_pendaftar = $pendaftar->orderBy('id', 'DESC')->first();

        $jurusan = new DataJurusan();
        $data['jurusan'] = $jurusan->findAll();
---
SELECT *
FROM `provinces`
ORDER BY `prov_name` ASC
SELECT *
FROM `jalur`
WHERE `id` = '15'
 LIMIT 1
SELECT *
FROM `tahap`
WHERE `id` = '9'
 LIMIT 1
SELECT *
FROM `periode`
WHERE `id` = '2'
 LIMIT 1
SELECT *
FROM `data_pendaftar`
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `jurusan`