app/Controllers/User.php

    public function index()
    {
        // proteksi halaman
        if (! session()->get('logged_in')) {
            session()->setFlashdata('error', 'Anda Belum Login !');
            return redirect()->to('/login');
        }
        $periode = new DataPeriode();
        $data['periode'] = $periode->where('status', 'aktif')->first();

        $tahap = new DataTahap();
        $date = date('Y-m-d');
        $data['tahap'] = $tahap->where(['id_periode' => $data['periode']->id, 'tanggal_mulai <=' => $date, 'tanggal_selesai >=' => $date])->first();
        if (empty($data['tahap'])) {
            $data['tahap'] = $tahap->where('id_periode', $data['periode']->id)->orderBy('id', 'DESC')->first();
        }

        $jurusan = new DataJurusan();
        $data['jurusan'] = $jurusan->where('status', 'aktif')->findAll();

        $jalur = new DataJalur();
        $data['jalur'] = $jalur->where('id_tahap', $data['tahap']->id)->findAll();
---
SELECT *
FROM `jalur`
WHERE `id_tahap` = '9'

    public function jalur($id)
    {

        $jalur = new DataJalur();
        $tahap = new DataTahap();
        $periode = new DataPeriode();
        $jurusan = new DataJurusan();
        $agenda = new DataAgenda();

        $data['periode'] = $periode->where('status', 'aktif')->first();
        $opsi_jalur = $this->codeAll('JALUR');
        $data['jurusan'] = $jurusan->where('status', 'aktif')->findAll();
        $data['agenda'] = $agenda->findAll();
        $date = date('Y-m-d');

        $data_tahap = $tahap->where(['id_periode' => $data['periode']->id, 'tanggal_mulai <=' => $date, 'tanggal_selesai >=' => $date])->first();
---
SELECT *
FROM `periode`
WHERE `status` = 'aktif'
 LIMIT 1
SELECT *
FROM `tahap`
WHERE `id_periode` = '2'

    public function login()
    {
        $periode = new DataPeriode();
        $tahap = new DataTahap();
        $jurusan = new DataJurusan();
        $jalur = new DataJalur();
        $agenda = new DataAgenda();
        $data['page'] = 'Beranda';
        $data['periode'] = $periode->where('status', 'aktif')->first();
        $data['jurusan'] = $jurusan->where('status', 'aktif')->findAll();
        $data['agenda'] = $agenda->findAll();
        $date = date('Y-m-d');

        $data_tahap = $tahap->where(['id_periode' => $data['periode']->id, 'tanggal_mulai <=' => $date, 'tanggal_selesai >=' => $date])->first();
        if (!$data_tahap) {
            $data['tahap'] = $tahap->where('id_periode', $data['periode']->id)->orderBy('id', 'DESC')->first();
            $html1 = '<a class="ms-3 mt-3 btn btn-lg btn-warning btn-daftar" href="#">Belum ada pendaftaran pada saat ini</a>';
            $html2 = '<a class="btn btn-warning" href="#">Belum ada pendaftaran pada saat ini</a>';
            $data['isi_jalur'] = $html1;
            $data['isi_jalurbtn'] = $html2;
            $html3 = '<a class="btn btn-primary disabled" style="background-color: #4D7C0F;" href="#">Daftar</a>';
            $data['daftar_nav'] = $html3;
            $data['jalur'] = $jalur->findAll();
        } else {
            $html2 = '<a class="ms-3 btn btn-lg btn-primary mt-3 btn-daftar" style="background-color: #4D7C0F;" href="'.site_url('jalur/' . $data_tahap->id).'">Daftar Disini</a>';
            $html3 = '<a class="btn btn-primary" style="background-color: #4D7C0F;" href="'.site_url('jalur/' . $data_tahap->id).'">Daftar</a>';
            $html1 = '<a class="btn btn-light" href="'.site_url('jalur/' . $data_tahap->id).'">Isi Disini</a>';
            $data['isi_jalur'] = $html2;
            $data['isi_jalurbtn'] = $html1;
            $data['daftar_nav'] = $html3;
            $data['tahap'] = $tahap->where(['id_periode' => $data['periode']->id, 'tanggal_mulai <=' => $date, 'tanggal_selesai >=' => $date])->first();
            $data['jalur'] = $jalur->where('id_tahap', $data_tahap->id)->findAll();
---
SELECT *
FROM `periode`
WHERE `status` = 'aktif'
 LIMIT 1
SELECT *
FROM `jurusan`
WHERE `status` = 'aktif'
SELECT *
FROM `agenda`
SELECT *
FROM `tahap`
WHERE `id_periode` = '2'
AND `tanggal_mulai` <= '2024-02-05'
AND `tanggal_selesai` >= '2024-02-05'
 LIMIT 1
SELECT *
FROM `jalur`
WHERE `id_tahap` = '12'

    public function cek_data()
    {
        $jalur = new DataJalur();
        $tahap = new DataTahap();
        $periode = new DataPeriode();
        $jurusan = new DataJurusan();
        $agenda = new DataAgenda();

        $data['periode'] = $periode->where('status', 'aktif')->first();
        $opsi_jalur = $this->codeAll('JALUR');
        $data['jurusan'] = $jurusan->where('status', 'aktif')->findAll();
        $data['agenda'] = $agenda->findAll();
        $date = date('Y-m-d');

        $data_tahap = $tahap->where(['id_periode' => $data['periode']->id, 'tanggal_mulai <=' => $date, 'tanggal_selesai >=' => $date])->first();
---
SELECT *
FROM `periode`
WHERE `status` = 'aktif'
 LIMIT 1
SELECT *
FROM `jurusan`
WHERE `status` = 'aktif'
SELECT *
FROM `agenda`
SELECT *
FROM `tahap`
WHERE `id_periode` = '2'
AND `tanggal_mulai` <= '2023-10-11'
AND `tanggal_selesai` >= '2023-10-11'
 LIMIT 1

            $data['isi_jalur'] = $html2;
            $data['isi_jalurbtn'] = $html1;
            $data['daftar_nav'] = $html3;
            $data['tahap'] = $tahap->where('id_periode', $data['periode']->id)->findall();
---
SELECT *
FROM `tahap`
WHERE `id_periode` = '2'

    public function list_agenda($id)
    {
        $agenda = new DataAgenda();
        $data['agenda'] = $agenda->findAll();
        $data['page'] = "List Agenda";

        $periode = new DataPeriode();
        $tahap = new DataTahap();
        $jurusan = new DataJurusan();
        $jalur = new DataJalur();
        $data['periode'] = $periode->where('status', 'aktif')->first();
        $data['jurusan'] = $jurusan->where('status', 'aktif')->findAll();
        $date = date('Y-m-d');

        $data_tahap = $tahap->where(['id_periode' => $data['periode']->id, 'tanggal_mulai <=' => $date, 'tanggal_selesai >=' => $date, 'status' => 'aktif'])->first();

        if (!$data_tahap) {
            $data['tahap'] = $tahap->where('id_periode', $data['periode']->id)->orderBy('id', 'DESC')->first();
            $html1 = '<a class="ms-3 mt-3 btn btn-lg btn-warning btn-daftar" href="#">Belum ada pendaftaran pada saat ini</a>';
            $html2 = '<a class="btn btn-warning" href="#">Belum ada pendaftaran pada saat ini</a>';
            $html3 = '<a class="btn btn-primary disabled" style="background-color: #4D7C0F;" href="#">Daftar</a>';
            $data['isi_jalur'] = $html1;
            $data['isi_jalurbtn'] = $html2;
            $data['daftar_nav'] = $html3;
            $data['jalur'] = $jalur->findAll();
---
SELECT *
FROM `agenda`
SELECT *
FROM `periode`
WHERE `status` = 'aktif'
 LIMIT 1
SELECT *
FROM `jurusan`
WHERE `status` = 'aktif'
SELECT *
FROM `tahap`
WHERE `id_periode` = '2'
AND `tanggal_mulai` <= '2023-03-11'
AND `tanggal_selesai` >= '2023-03-11'
AND `status` = 'aktif'
 LIMIT 1
SELECT *
FROM `tahap`
WHERE `id_periode` = '2'
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `jalur`