app/Controllers/User.php

    public function list_agenda()
    {
        $agenda = new DataAgenda();
        $data['agenda'] = $agenda->findAll();
---
SELECT *
FROM `agenda`