app/Controllers/Worksheet.php

SELECT *
FROM `provinces`
ORDER BY `prov_name` ASC
SELECT *
FROM `tahap`
WHERE `id` = '9'
 LIMIT 1
SELECT *
FROM `jalur`
WHERE `id_tahap` = '9'
 LIMIT 1
SELECT *
FROM `periode`
WHERE `id` = '2'
 LIMIT 1
SELECT *
FROM `data_pendaftar`
ORDER BY `id` DESC
 LIMIT 1
---
    public function import($id)
    {
        $countryModel = new Provinces();
        $data['country'] = $countryModel->orderBy('prov_name', 'ASC')->findAll();

    // get input nomor pendaftar
        $tahap = new DataTahap();
        $jalur = new DataJalur();
        $user = new Users();
        $pendaftaran = new DataPendaftaran();
        $data['tahap'] = $tahap->where('id',$id)->first();
        $data['jalur1'] = $jalur->where('id_tahap', $data['tahap']->id)->first();
        $periode = new DataPeriode();
        $data['periode'] = $periode->where('id', $data['tahap']->id_periode)->first();
        $pendaftar = new DataPendaftar();
        $data_pendaftar = $pendaftar->orderBy('id', 'DESC')->first();

SELECT *
FROM `data_sekolah`
 LIMIT 1
---
                $nik = $pendaftar->where('nik',$value[3])->first();

                $sekolah = new DataSekolah();
                $getsekolah = $sekolah->first();

INSERT INTO `data_pendaftar` (`nama_lengkap`, `nisn`, `nik`, `tempat_lahir`, `tanggal_lahir`, `jenis_kelamin`, `alamat`, `nomor_hp`, `email`, `asal_sekolah`, `type_asal_sekolah`, `status_penerimaan`, `type_registration`) VALUES ('Ari Pras', '1212121212', '3302081205970000', 'Banyumas', '1997-05-02', 'l', 'Jln Raya Tambak\nPurwodadi', '089658176349', 'synystrgates0210@gmail.com', 'SMP NEGERI 1 MAJENANG', 'off', 101, 2)
INSERT INTO `pendaftaran` (`id_pendaftar`, `periode`, `tahap`, `jalur`) VALUES (20, '2', '9', '15')
INSERT INTO `user` (`role`, `id_ref`, `status`, `password`, `nomor_pendaftaran`, `email`) VALUES ('2', 20, 'aktif', '$2y$10$nfoOuo/ZsmU9SGgGG5GreOx3aBJzR7N6aHOMZpNUxG7iOHneFDfbi', '291500020', 'synystrgates0210@gmail.com')
---
                if (!$email) {
                    if (!$nisn) {
                        if (!$nik) {
                            $pendaftar->insert([
                                "nama_lengkap" =>$value[1],
                                "nisn" =>$value[2],
                                "nik" =>$value[3],
                                "tempat_lahir" =>$value[4],
                                "tanggal_lahir" =>$value[5],
                                "jenis_kelamin" =>$value[6],
                                "alamat" =>$value[7],
                                "nomor_hp" =>$value[8],
                                "email" =>$value[9],
                                "asal_sekolah" =>$value[10],
                                "type_asal_sekolah" => $state,
                                "status_penerimaan" => 101,
                                "type_registration" => 2,
                            ]);
                            $pendaftar_id = $pendaftar->getInsertID();
                            $pendaftaran->insert([
                                "id_pendaftar" => $pendaftar_id,
                                "periode" => $this->request->getPost('periode'),
                                "tahap" => $this->request->getPost('tahap'),
                                "jalur" => $this->request->getPost('jalur'),
                            ]);
                            $user->insert([
                                "role" => '2',
                                "id_ref" => $pendaftar_id,
                                "status" => 'aktif',
                                "password" => $pass,
                                "nomor_pendaftaran" => $data['periode']->id . $data['tahap']->id . $data['jalur1']->id . '000' . $pendaftar_id,
                                "email" => $value[9],
                            ]);